"""
Користувач вводить слово, якщо це слово є поліндромом, вивести '+', інакше '-'
"""


"""
Користувач вводить текст і слово, яке потрібно знайти, якщо це слово є в тексті, вивести 'YES', інакше 'NO'
"""

"""
Написати валідатор для пошти. 
Користувач вводить пошту, а програма повинна перевірити, що в пошті є символ '@' і '.', 
і якщо це так, вивести "YES", інакше "NO"
"""

"""
Користувач вводить текст через пробіл. 
Конвертувати текст у список. 
Вивести останні 3 елементи зі списку, якщо список містить менше 3-х елементів, 
вивести повідомлення про те що кількість елементів менша за 3 і вказати кількість елементів поточного списку
"""

"""
Додати перевірку введеної IP-адреси. Адреса вважається коректно заданою, якщо вона:
складається з 4 чисел (а не літер чи інших символів)
числа розділені точкою
кожне число в діапазоні від 0 до 255 Якщо адреса неправильна, виводьте повідомлення: «Неправильна IP-адреса». 
Повідомлення "Неправильна IP-адреса" має виводитися лише один раз, навіть якщо кілька пунктів вище не виконані.
"""
